---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceAdjacentSpaceId1
source: html/a0dd450b-2678-928d-e5e8-4c16b676dcf7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceAdjacentSpaceId1 Property

"Adjacent Space Id (1)"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisSurfaceAdjacentSpaceId1 { get; }
```